app/views/tutorials/index.html.erb

          <%= bootstrap_form_for(:tutorial,:html => {:id => "myForm"} ) do |f| %>
          <%if Subject.all.blank?%>
---
SELECT "subjects".* FROM "subjects"


            <%if Tutor.where(status:true).blank?%>
---
SELECT "tutors".* FROM "tutors" WHERE "tutors"."status" = $1  [["status", true]]

            <%else%>
                <%if Student.where(status:true).where(entry: @period).where(careercode: @codes[0])
    .or(Student.where(status:true).where(entry: @period).where(careercode: @codes[1]))
    .or(Student.where(status:true).where(entry: @period).where(careercode: @codes[2]))
    .or(Student.where(status:true).where(entry: @period).where(careercode: @codes[3])).blank?%>
---
SELECT "students".* FROM "students" WHERE "students"."status" = $1 AND "students"."entry" = $2 AND ((("students"."careercode" = $3 OR "students"."careercode" = $4) OR "students"."careercode" IS NULL) OR "students"."careercode" IS NULL)  [["status", true], ["entry", 2017], ["careercode", 1353], ["careercode", 1363]]

         <!--  <button type="submit" class="btn btn-primary"><i class="fas fa-save"></i> Guardar</button> -->
          <%if Tutor.where(status:true).blank? || Student.where(status:true).blank?%>
---
SELECT "students".* FROM "students" WHERE "students"."status" = $1  [["status", true]]
SELECT "tutors".* FROM "tutors" WHERE "tutors"."status" = $1  [["status", true]]