app/controllers/academic_units_controller.rb

    def show
        @academic_unit = AcademicUnit.find(params[:id])
---
SELECT  "academic_units".* FROM "academic_units" WHERE "academic_units"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        @academic_unit = AcademicUnit.new(academic_unit_params)

        @academic_unit.save
---
INSERT INTO "academic_units" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "FACULTAD DE QUIMICA Y BIOLOGÍA"], ["created_at", "2020-06-30 22:30:48.127368"], ["updated_at", "2020-06-30 22:30:48.127368"]]