app/controllers/application_controller.rb

  def readCareer
    @careers= Career.all
    @carreers4department=[]
      File.open('careerFile.txt', 'r') do |f1|
        while linea = f1.gets
         @departmentid = linea.chomp
        end
      end

    @careers.each do |car|
---
SELECT "careers".* FROM "careers"

  def notification
    studentannotations = Studentannotation.where(typeannotation_id:2).where(derivation:current_user.id).where(statusannotation_id:1) #alerta
    @notify=studentannotations.count
---
SELECT COUNT(*) FROM "studentannotations" WHERE "studentannotations"."typeannotation_id" = $1 AND "studentannotations"."derivation" = $2 AND "studentannotations"."statusannotation_id" = $3  [["typeannotation_id", 2], ["derivation", 1], ["statusannotation_id", 1]]