app/controllers/careers_controller.rb

SELECT "careers".* FROM "careers"
---
  def index
    @careers = Career.all

INSERT INTO "careers" ("code", "name", "department_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["code", 1313], ["name", "Carrera de autos"], ["department_id", 9], ["created_at", "2020-07-07 15:01:19.408096"], ["updated_at", "2020-07-07 15:01:19.408096"]]
---
  def create
    @career = Career.new(career_params)

    if @career.save

SELECT  "careers".* FROM "careers" WHERE "careers"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "careers" WHERE "careers"."id" = $1  [["id", 11]]
---
  def destroy
    @career = Career.find(params[:id])
    if @career.destroy