app/controllers/departments_controller.rb

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @department = Department.find(params[:id])

SELECT  "academic_units".* FROM "academic_units" WHERE "academic_units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "departments" ("name", "created_at", "updated_at", "academic_unit_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "DEPARTAMENTO DE MATEMáTICA"], ["created_at", "2020-07-07 14:22:54.375914"], ["updated_at", "2020-07-07 14:22:54.375914"], ["academic_unit_id", 3]]
---
  def create
    @academic_unit = AcademicUnit.find(params[:academic_unit_id])
    @department = Department.new(department_params)
    @department.name= params[:department][:name].upcase!


      if @department.save

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 11]]
---
  def destroy

    @department = Department.find(params[:id])
    if @department.destroy