app/controllers/students_controller.rb

SELECT "careers".* FROM "careers"
SELECT  "students".* FROM "students" WHERE "students"."status" = $1 AND "students"."entry" = $2 AND ((("students"."careercode" = $3 OR "students"."careercode" = $4) OR "students"."careercode" IS NULL) OR "students"."careercode" IS NULL) AND "students"."id" = $5 LIMIT $6  [["status", true], ["entry", 2017], ["careercode", 1353], ["careercode", 1363], ["id", 1], ["LIMIT", 1]]
---
  def index
    require 'rest-client'
    require 'json'

    unless current_user.admin? or current_user.coordinador? or current_user.tutor?
      redirect_to '/', :alert => "Acceso denegado."
    end

    @careers = Career.all
    @codes=[]
    count=0
    @careers.each do |c|
        if c.id == @carreers4department[count]
            @codes<< c.code
           count=count+1
         end

    end

    @students = Student.where(status:true).where(entry: @period).where(careercode: @codes[0])
    .or(Student.where(status:true).where(entry: @period).where(careercode: @codes[1]))
    .or(Student.where(status:true).where(entry: @period).where(careercode: @codes[2]))
    .or(Student.where(status:true).where(entry: @period).where(careercode: @codes[3]))

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."role_id" = $1  [["role_id", 3]]
SELECT "studentannotations".* FROM "studentannotations" WHERE "studentannotations"."student_id" = $1 AND "studentannotations"."user_id" = $2 ORDER BY created_at DESC  [["student_id", 1], ["user_id", 2]]
SELECT "studentannotations".* FROM "studentannotations" WHERE "studentannotations"."student_id" = $1 ORDER BY created_at DESC  [["student_id", 1]]
SELECT "careers".* FROM "careers"
SELECT "student_tutorials".* FROM "student_tutorials"
---
  def show
    unless current_user.admin? or current_user.coordinador? or current_user.tutor?
      redirect_to '/', :alert => "Acceso denegado."
    end
    idd=params[:id]
    student = Student.find(params[:id])
    @coordinadores= User.where(role_id:3)




  	if student.status==true
      if @student= Student.find(params[:id])
          if current_user.tutor?
            @studentannotations = Studentannotation.where(student_id:idd).where(user_id:current_user.id).order("created_at DESC")
          else
            @studentannotations = Studentannotation.where(student_id:idd).order("created_at DESC")
          end

          careers = Career.all
            careers.each do |career|
                if @student.careercode == career.code
                  @career = career.name
                end
              end

            asistutorials = StudentTutorial.all
            @presente=0
            @ausente=0
              asistutorials.each do |asistencia|

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "level" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["level", 7], ["updated_at", "2020-06-30 14:56:13.269379"], ["id", 1]]
---
  def update
    unless current_user.admin? or current_user.coordinador? or current_user.tutor?
      redirect_to '/', :alert => "Acceso denegado."
    end

    @student = Student.find(params[:id])


    if current_user.admin? or current_user.coordinador?
        if @student.update_attributes(student_params)