app/controllers/tutors_controller.rb

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."status" = $1 AND "tutors"."id" = $2 LIMIT $3  [["status", true], ["id", 4], ["LIMIT", 1]]
SELECT "careers".* FROM "careers"
---
  def index
    unless current_user.admin? or current_user.coordinador?
      redirect_to '/', :alert => "Acceso denegado." #por ahora solo un adminsitrador puede ver esto
    end

    @tutors = Tutor.where(status:true)
    @careers = Career.all

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "tutor_tutorials".* FROM "tutor_tutorials"
---
  def show
    unless current_user.admin? or current_user.coordinador?
      redirect_to '/', :alert => "Acceso denegado." #por ahora solo un adminsitrador puede ver esto
    end
    tutor = Tutor.find(params[:id])
  if tutor.status==true
      if @tutor = Tutor.find(params[:id])
        if @tutor.blank?
            redirect_to '/404'
        else

        asistutorials = TutorTutorial.all
        @presente=0
        @ausente=0
          asistutorials.each do |asistencia|

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_tutor
      @tutor = Tutor.find(params[:id])