app/views/academic_units/show.html.erb


                    <% @academic_unit.departments.each do |department| %>
---
SELECT "departments".* FROM "departments" WHERE "departments"."academic_unit_id" = $1  [["academic_unit_id", 3]]