app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "rolesdevise", "role_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
   def create
     @user = User.new(user_params)
     case @user.role_id # a_variable is the variable we want to compare
      when 1
        @user.rolesdevise = :admin

      when 2
        @user.rolesdevise = :tutor

      when 3
        @user.rolesdevise = :coordinador

      else
        @user.rolesdevise = :supervisor

      end

      @user.password= @user.email
    @user.password_confirmation=@user.email
    if @user.save